---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotDrawStairsError
source: html/fdb6c343-77ee-166e-3017-4cfff5b5dd65.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotDrawStairsError Property

Can't make stairs

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotDrawStairsError { get; }
```